# Тема “Вычисления с помощью Numpy”
Задание 1

In [125]:
import numpy as np

In [126]:
a = np.transpose([[1, 2, 3, 3, 1],
              [6, 8, 11, 10, 7]])
print (a)

[[ 1  6]
 [ 2  8]
 [ 3 11]
 [ 3 10]
 [ 1  7]]

In [127]:
mean_a = a.mean(axis=0)
print (mean_a)

[2.  8.4]

ЗАДАНИЕ 2

In [128]:
a_centered = a - mean_a
print (a_centered)

[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

ЗАДАНИЕ 3

In [129]:
a_centered_sp = np.dot ((np.transpose(a_centered)[0, :]),(np.transpose(a_centered)[1, :]))
print (a_centered_sp)

8.0

In [130]:
result3 = a_centered_sp / (a[:,0].size -1)
print (result3)

2.0

ЗАДАНИЕ 4

In [131]:
(np.cov(a.T))[0,1]

2.0

# Тема “Работа с данными в Pandas”
Задание 1

In [132]:
import pandas as pd

In [133]:
authors = pd.DataFrame({
    'author_id': [1, 2, 3],
    'author_name': ['Тургенев', 'Чехов', 'Островский']})
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [134]:
books = pd.DataFrame({
     'author_id': [1, 1, 1, 2, 2, 3, 3],
     'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
     'price': [450, 300, 350, 500, 450, 370, 290]})
books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

Задание 2
Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [135]:
authors_price = pd.merge (authors, books, on='author_id', how='outer')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

Задание 3
Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [136]:
top5 = authors_price.nlargest(5, "price")
top5.reset_index(drop=True, inplace=True)
top5

   author_id author_name         book_title  price
0          2       Чехов   Толстый и тонкий    500
1          1    Тургенев        Отцы и дети    450
2          2       Чехов    Дама с собачкой    450
3          3  Островский              Гроза    370
4          1    Тургенев  Дворянское гнездо    350

Задание 4
Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.

In [141]:
authors_price.loc[authors_price["book_title"].notnull(),"min_price"] = authors_price["price"]

authors_price.loc[authors_price["book_title"].notnull(),"max_price"] = authors_price["price"]

authors_price.loc[authors_price["book_title"].notnull(),"mean_price"] = authors_price["price"]

authors_price

,author_id,author_name,book_title,price,min_price,max_price,mean_price
0,1,Тургенев,Отцы и дети,450,450,450,450
1,1,Тургенев,Рудин,300,300,300,300
2,1,Тургенев,Дворянское гнездо,350,350,350,350
3,2,Чехов,Толстый и тонкий,500,500,500,500
4,2,Чехов,Дама с собачкой,450,450,450,450
5,3,Островский,Гроза,370,370,370,370
6,3,Островский,Таланты и поклонники,290,290,290,290

In [151]:

groupby = authors_price.groupby("author_name")
groupby.agg({"min_price": "min", "max_price": "max", "mean_price": "mean"})

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000